truncate table public.route restart identity;

INSERT INTO "public"."route" ("id", "name", "method","menu_id", "menu_name", "created_at", "updated_at", "deleted_at") VALUES
(1,'/api/accounts', 'POST', 2, '用户管理', '2025-05-16 20:35:57.320156+08', '2025-05-16 20:35:57.320156+08', NULL),
(2,'/api/accounts', 'GET', 2, '用户管理', '2025-05-16 20:35:57.320156+08', '2025-05-16 20:35:57.320156+08', NULL),
(3,'/api/accounts/:id/detail', 'GET', 2, '用户管理', '2025-05-16 20:35:57.320156+08', '2025-05-16 20:35:57.320156+08', NULL),
(4,'/api/menus', 'GET', 2, '用户管理', '2025-05-16 20:35:57.320156+08', '2025-05-16 20:35:57.320156+08', NULL),
(5,'/api/roles', 'POST', 3, '角色设置', '2025-05-16 20:35:57.320156+08', '2025-05-16 20:35:57.320156+08', NULL),
(6,'/api/roles/:id/detail', 'GET', 3, '角色设置', '2025-05-16 20:35:57.320156+08', '2025-05-16 20:35:57.320156+08', NULL),
(7,'/api/roles', 'GET', 3, '角色设置', '2025-05-16 20:35:57.320156+08', '2025-05-16 20:35:57.320156+08', NULL),
(8,'/api/organizations', 'POST', 2, '用户管理', '2025-05-16 20:35:57.320156+08', '2025-05-16 20:35:57.320156+08', NULL),
(9,'/api/organizations/:id/detail', 'GET', 2, '用户管理', '2025-05-16 20:35:57.320156+08', '2025-05-16 20:35:57.320156+08', NULL),
(10,'/api/organizations/tree', 'GET', 2, '用户管理', '2025-05-16 20:35:57.320156+08', '2025-05-16 20:35:57.320156+08', NULL);
